src/InformationRegisters/СтатистикаБуферДатаВнешниеЦКК/СтатистикаБуферДатаВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаБуферДатаВнешниеЦКК</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоJSON</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнешнийЦКК</name>
    <type>
      <types>CatalogRef.ВнешниеЦКК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомерПакета</name>
    <comment>Значение - ТекущаяУниверсальнаяДатаВМиллисекундах()</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаБуферДатаВнешниеЦКК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьТекущиеНомераПакетовДляОтправки(ВнешнийЦКК, МаксимальныйНомерПакета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатистикаБуферДатаВнешниеЦКК.ПорядковыйНомерПакета КАК ПорядковыйНомерПакета
	|ИЗ
	|	РегистрСведений.СтатистикаБуферДатаВнешниеЦКК КАК СтатистикаБуферДатаВнешниеЦКК
	|ГДЕ
	|	СтатистикаБуферДатаВнешниеЦКК.ВнешнийЦКК = &ВнешнийЦКК
	|	И СтатистикаБуферДатаВнешниеЦКК.ПорядковыйНомерПакета <= &МаксимальныйНомерПакета
	|";
	
	Запрос.УстановитьПараметр("ВнешнийЦКК", ВнешнийЦКК);
	Запрос.УстановитьПараметр("МаксимальныйНомерПакета", МаксимальныйНомерПакета);
	
	Результат = Запрос.Выполнить();
	
	НомераПакетов = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомераПакетов.Добавить(Выборка.ПорядковыйНомерПакета);
	КонецЦикла;
	
	Возврат НомераПакетов;
КонецФункции

Процедура УдалитьДанныеПакета(ВнешнийЦКК, ПорядковыйНомерПакета) Экспорт
	НаборЗаписей = РегистрыСведений.СтатистикаБуферДатаВнешниеЦКК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВнешнийЦКК.Установить(ВнешнийЦКК);
	НаборЗаписей.Отбор.ПорядковыйНомерПакета.Установить(ПорядковыйНомерПакета);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецЕсли
